# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\Git\microcontroller-test-code\PSOC4000S\dmx.cydsn\dmx.cyprj
# Date: Sun, 01 Oct 2017 04:13:16 GMT
#set_units -time ns
create_clock -name {ADC_1_ModClk(FFB)} -period 63750 -waveform {0 31875} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {UART_SCBCLK(FFB)} -period 500 -waveform {0 250} [list [get_pins {ClockBlock/ff_div_0}]]
create_clock -name {Clock_1(FFB)} -period 1000 -waveform {0 500} [list [get_pins {ClockBlock/ff_div_3}] [get_pins {ClockBlock/ff_div_4}] [get_pins {ClockBlock/ff_div_5}]]
create_clock -name {CyILO} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 31.25 -waveform {0 15.625} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 250 -waveform {0 125} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 500 -waveform {0 125} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {ADC_1_ModClk} -source [get_pins {ClockBlock/hfclk}] -edges {1 255 511} [list]
create_generated_clock -name {UART_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 5} [list]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 5 9} [list]


# Component constraints for D:\Git\microcontroller-test-code\PSOC4000S\dmx.cydsn\TopDesign\TopDesign.cysch
# Project: D:\Git\microcontroller-test-code\PSOC4000S\dmx.cydsn\dmx.cyprj
# Date: Sun, 01 Oct 2017 04:13:15 GMT
